wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
#define DEFAULT_TRANSMIT_MODE 0x0000 //Gazell
uint8_t is_softdevice_enabled = false;
/****************************** wright change mode end ******************************/



/****************************** wright for swipe **************************/
static m_keyboard_data_t  s_gzll_keepalive_keyboard_pkt;
APP_TIMER_DEF(s_gzll_keep_alive_id);
static void m_keyboard_handler(void * p_event_data, uint16_t event_size);
static void gzll_keep_alive_handler();

/****************************** wright for swipe end**************************/

/**Buffer queue access macros
 *
 * @{ */

//#define MAX_BUFFER_ENTRIES                  5                                          /**< Number of elements that can be enqueued */

///** Initialization of buffer list */
//#define BUFFER_LIST_INIT()     \
//    do                         \
//    {                          \
//        buffer_list.rp    = 0; \
//        buffer_list.wp    = 0; \
//        buffer_list.count = 0; \
//    } while (0)

///** Provide status of data list is full or not */
//#define BUFFER_LIST_FULL() \
//    ((MAX_BUFFER_ENTRIES == buffer_list.count - 1) ? true : false)

///** Provides status of buffer list is empty or not */
//#define BUFFER_LIST_EMPTY() \
//    ((0 == buffer_list.count) ? true : false)

//#define BUFFER_ELEMENT_INIT(i)                 \
//    do                                         \
//    {                                          \
//        buffer_list.buffer[(i)].p_data = NULL; \
//    } while (0)
//		
///** @} */

///** Abstracts buffer element */
//typedef struct hid_key_buffer
//{
//    uint8_t      data_offset; /**< Max Data that can be buffered for all entries */
//    uint8_t      data_len;    /**< Total length of data */
//    uint8_t    * p_data;      /**< Scanned key pattern */
//} buffer_entry_t;

//STATIC_ASSERT(sizeof(buffer_entry_t) % 4 == 0);

///** Circular buffer list */
//typedef struct
//{
//    buffer_entry_t buffer[MAX_BUFFER_ENTRIES]; /**< Maximum number of entries that can enqueued in the list */
//    uint8_t        rp;                         /**< Index to the read location */
//    uint8_t        wp;                         /**< Index to write location */
//    uint8_t        count;                      /**< Number of elements in the list */
//} buffer_list_t;

//STATIC_ASSERT(sizeof(buffer_list_t) % 4 == 0);

//static buffer_list_t     buffer_list;                               /**< List to enqueue not just data to be sent, but also related information like the handle, connection handle etc */


APP_TIMER_DEF(m_app_gzll_search_timer_id);

APP_TIMER_DEF(m_battery_timer_id);                                  /**< Battery timer. */

static uint8_t m_sample_key_press_scan_str[] = /**< Key pattern to be sent when the key press button has been pushed. */
{
    0x0b,       /* Key h */
    0x08,       /* Key e */
    0x0f,       /* Key l */
    0x0f,       /* Key l */
    0x12,       /* Key o */
    0x28        /* Key Return */
};

static uint8_t m_caps_on_key_scan_str[] = /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit set. */
{
    0x06,       /* Key C */
    0x04,       /* Key a */
    0x13,       /* Key p */
    0x16,       /* Key s */
    0x12,       /* Key o */
    0x11,       /* Key n */
};

static uint8_t m_caps_off_key_scan_str[] = /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit cleared. */
{
    0x06,       /* Key C */
    0x04,       /* Key a */
    0x13,       /* Key p */
    0x16,       /* Key s */
    0x12,       /* Key o */
    0x09,       /* Key f */
};


static uint32_t              m_protocol_mode;
static bool              m_caps_on = false;                         /**< Variable to indicate if Caps Lock is turned on. */
//static bool              is_bonded = false;

static sensorsim_cfg_t   m_battery_sim_cfg;                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;                       /**< Battery Level sensor simulator state. */

static nrf_drv_gpiote_in_config_t		protocol_detect_pin_cfg;

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the battery sensor simulator.
 */
static void sensor_simulator_init(void)
{
    m_battery_sim_cfg.min          = MIN_BATTERY_LEVEL;
    m_battery_sim_cfg.max          = MAX_BATTERY_LEVEL;
    m_battery_sim_cfg.incr         = BATTERY_LEVEL_INCREMENT;
    m_battery_sim_cfg.start_at_max = true;

    sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);
}



/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    uint8_t  battery_level;

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    m_coms_ble_bas_send(battery_level);
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

