wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
static void app_gzll_search_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    m_coms_gzll_search_for_host();
}	


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
    if(m_protocol_mode == M_COMS_BLE_MODE_PAIR_1 || m_protocol_mode == M_COMS_BLE_MODE_PAIR_2)
    {	
        err_code = app_timer_create(&m_battery_timer_id,
                                   APP_TIMER_MODE_REPEATED,
                                   battery_level_meas_timeout_handler);
      
		}	
		else  //M_COMS_GZLL_MODE
		{
//        err_code = app_timer_create(&m_app_gzll_search_timer_id,
//                                   APP_TIMER_MODE_SINGLE_SHOT,
//                                   app_gzll_search_timeout_handler);
			
			
			//wright for swipe problem
			app_timer_create(&s_gzll_keep_alive_id, APP_TIMER_MODE_REPEATED, gzll_keep_alive_handler);
			
    }		



    APP_ERROR_CHECK(err_code);
}

static void clock_start( void )
{   
    uint32_t err_code = nrf_drv_clock_init();
    
		APP_ERROR_CHECK(err_code);
	
    nrf_drv_clock_lfclk_request(NULL);
	
}


/**@brief Function for starting timers.
 */
static void application_timers_start(void)
{
   if(m_protocol_mode == M_COMS_BLE_MODE_PAIR_1 || m_protocol_mode == M_COMS_BLE_MODE_PAIR_2)
   {	    
	     /* YOUR_JOB: Start your timers. below is an example of how to start a timer.*/
       ret_code_t err_code;	
       err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
       APP_ERROR_CHECK(err_code);
   }
}


/**@brief   Function for transmitting a key scan Press & Release Notification.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern. 0 < pattern_len < 7.
 * @param[in]  pattern_offset Offset applied to Key Pattern for transmission.
 * @param[out] actual_len     Provides actual length of Key Pattern transmitted, making buffering of
 *                            rest possible if needed.
 * @return     NRF_SUCCESS on success, NRF_ERROR_RESOURCES in case transmission could not be
 *             completed due to lack of transmission buffer or other error codes indicating reason
 *             for failure.
 *
 * @note       In case of NRF_ERROR_RESOURCES, remaining pattern that could not be transmitted
 *             can be enqueued \ref buffer_enqueue function.
 *             In case a pattern of 'cofFEe' is the p_key_pattern, with pattern_len as 6 and
 *             pattern_offset as 0, the notifications as observed on the peer side would be
 *             1>    'c', 'o', 'f', 'F', 'E', 'e'
 *             2>    -  , 'o', 'f', 'F', 'E', 'e'
 *             3>    -  ,   -, 'f', 'F', 'E', 'e'
 *             4>    -  ,   -,   -, 'F', 'E', 'e'
 *             5>    -  ,   -,   -,   -, 'E', 'e'
 *             6>    -  ,   -,   -,   -,   -, 'e'
 *             7>    -  ,   -,   -,   -,   -,  -
 *             Here, '-' refers to release, 'c' refers to the key character being transmitted.
 *             Therefore 7 notifications will be sent.
 *             In case an offset of 4 was provided, the pattern notifications sent will be from 5-7
 *             will be transmitted.
 */
static uint32_t send_key_scan_press_release(
                                            uint8_t    * p_key_pattern,
                                            uint16_t     pattern_len,
                                            uint16_t     pattern_offset,
                                            uint16_t   * p_actual_len)
{
    ret_code_t err_code = NRF_SUCCESS;
    uint16_t offset;
    uint16_t data_len;
    uint8_t  data[INPUT_REPORT_KEYS_MAX_LEN];

    // HID Report Descriptor enumerates an array of size 6, the pattern hence shall not be any
    // longer than this.
    STATIC_ASSERT((INPUT_REPORT_KEYS_MAX_LEN - 2) == 6);

    ASSERT(pattern_len <= (INPUT_REPORT_KEYS_MAX_LEN - 2));

    offset   = pattern_offset;
    data_len = pattern_len;

    do
    {
        // Reset the data buffer.
        memset(data, 0, sizeof(data));

        // Copy the scan code.
        memcpy(data + SCAN_CODE_POS + offset, p_key_pattern + offset, data_len - offset);
				//wright : Fix for not to infect GPIO output
				//wright : TODO : knowing how to add SHIFT key vaule into data befor sending. 
//        if (bsp_button_is_pressed(SHIFT_BUTTON_ID))
//        {
//            data[MODIFIER_KEY_POS] |= SHIFT_KEY_CODE;
//        }

				if (m_protocol_mode == M_COMS_BLE_MODE_PAIR_1 || m_protocol_mode == M_COMS_BLE_MODE_PAIR_2 )
				{
					m_coms_ble_hid_report_send(0, data);
        }
				else
				{
          m_coms_gzll_send(1 ,data, sizeof(data));
        }									
        offset++;
    }
    while (offset <= data_len);

    *p_actual_len = offset;

    return err_code;
}


//wright : fix for not detecting modifier keys.
static uint32_t send_key_scan_press_release_fix(
                                            uint8_t    * p_key_pattern,
                                            uint16_t     pattern_len,
                                            uint16_t     pattern_offset,
                                            uint16_t   * p_actual_len,
																						uint8_t     p_modifer
)
{

    ret_code_t err_code = NRF_SUCCESS;
    uint16_t offset;
    uint16_t data_len;
    uint8_t  data[INPUT_REPORT_KEYS_MAX_LEN];

    // HID Report Descriptor enumerates an array of size 6, the pattern hence shall not be any
    // longer than this.
    STATIC_ASSERT((INPUT_REPORT_KEYS_MAX_LEN - 2) == 6);

    ASSERT(pattern_len <= (INPUT_REPORT_KEYS_MAX_LEN - 2));

    offset   = pattern_offset;
    data_len = pattern_len;


        // Reset the data buffer.
        memset(data, 0, sizeof(data));

        // Copy the scan code.
        memcpy(data + SCAN_CODE_POS + offset, p_key_pattern + offset, data_len - offset);


