wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
}

//wright : fix for not detecting modifier keys.
static void keys_send_fix(uint8_t key_pattern_len, uint8_t * p_key_pattern,uint8_t p_modifier)
{
		//wright : 0415
		NRF_LOG_INFO("----- ENTER keys_send_fix -----");
		NRF_LOG_INFO("Num_Key: %d",key_pattern_len);
		NRF_LOG_HEXDUMP_INFO(p_key_pattern, 6);
	
	
    ret_code_t err_code;
    uint16_t actual_len;

    err_code = send_key_scan_press_release_fix(p_key_pattern,
                                           key_pattern_len,
                                           0,
                                           &actual_len,
																						p_modifier);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
		
}

/**@brief Function for handling the HID Report Characteristic Write event.
 *
 * @param[in]   p_evt   HID service event.
 */
static void on_hid_rep_char_write(uint8_t report_val, uint8_t length)
{
	 ret_code_t err_code;
	
            if (!m_caps_on && ((report_val & OUTPUT_REPORT_BIT_MASK_CAPS_LOCK) != 0))
            {
                // Caps Lock is turned On.
                NRF_LOG_INFO("Caps Lock is turned On!");
                
								//wright : fix for not to infect GPIO output
								//err_code = bsp_indication_set(BSP_INDICATE_ALERT_3);
							
                APP_ERROR_CHECK(err_code);
								
                keys_send(sizeof(m_caps_on_key_scan_str), m_caps_on_key_scan_str);
                m_caps_on = true;
            }
            else if (m_caps_on && ((report_val & OUTPUT_REPORT_BIT_MASK_CAPS_LOCK) == 0))
            {
                // Caps Lock is turned Off .
                NRF_LOG_INFO("Caps Lock is turned Off!");
							
								//wright : fix for not to infect GPIO output
								//err_code = bsp_indication_set(BSP_INDICATE_ALERT_OFF);
							
                APP_ERROR_CHECK(err_code);

                keys_send(sizeof(m_caps_off_key_scan_str), m_caps_off_key_scan_str);
                m_caps_on = false;
            }
            else
            {
                // The report received is not supported by this application. Do nothing.
            }
}

/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;
		//wright : fix for not to infect GPIO output
    //err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
		//wright : fix for not to infect GPIO output
    //err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);
	
	  NRF_LOG_INFO("Go to sleep zzzzz");	
	       
		 m_coms_ble_sleep_mode_enter();		 
}



/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    app_sched_execute();
	
	  if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void m_coms_ble_evt_handler(void * p_event_data, uint16_t event_size)
{
	 m_coms_ble_evt_t * p_evt = (m_coms_ble_evt_t *) p_event_data;;
   uint32_t           err_code;
   uint8_t            report;
	

	 switch (p_evt->type)
   {
		 
		 case M_COMS_BLE_EVT_ADV_DIRECTED_HIGH_DUTY:			 
		      NRF_LOG_INFO("High Duty Directed advertising.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
          //APP_ERROR_CHECK(err_code);
          break;
		 
		 case M_COMS_BLE_EVT_ADV_DIRECTED:
			    NRF_LOG_INFO("Directed advertising.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
          //APP_ERROR_CHECK(err_code);	 
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_FAST:			   
          NRF_LOG_INFO("Fast advertising.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
          //APP_ERROR_CHECK(err_code);
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_SLOW:
			    NRF_LOG_INFO("Slow advertising.");
					//wright : fix for not to infect GPIO output
          //err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_SLOW);
          //APP_ERROR_CHECK(err_code);
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_FAST_WHITELIST:
			    NRF_LOG_INFO("Fast advertising with whitelist.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
          //APP_ERROR_CHECK(err_code);
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_SLOW_WHITELIST:
			    NRF_LOG_INFO("Slow advertising with whitelist.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
          //APP_ERROR_CHECK(err_code);
		      break;
			
		 case M_COMS_BLE_EVT_ADV_IDLE:
			 //wright : debug		
		 NRF_LOG_INFO("-----M_COMS_BLE_EVT_ADV_IDLE-----");
			    //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_IDLE);
          //APP_ERROR_CHECK(err_code);
		      sleep_mode_enter();
          break;
         
		 
		 case M_COMS_BLE_EVT_CONNECTED:
			    NRF_LOG_INFO("Connected");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
          //APP_ERROR_CHECK(err_code);	
		      break;
		 
