wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
		 case M_COMS_BLE_EVT_DISCONNECTED:
			 
					//wright : TODO find the reason about disconection.
		      NRF_LOG_INFO("Disconnected");
          // Dequeue all keys without transmission.
          //(void) buffer_dequeue(false);	        
          // Reset m_caps_on variable. Upon reconnect, the HID host will re-send the Output
          // report containing the Caps lock state.
          m_caps_on = false;
          // disabling alert 3. signal - used for capslock ON
		 
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ALERT_OFF);
          //APP_ERROR_CHECK(err_code);	
		      //bsp_board_led_off(BSP_LED_INDICATE_USER_LED1);
		      //bsp_board_led_off(BSP_LED_INDICATE_USER_LED2);
		 
          break;
		 
		 case M_COMS_BLE_EVT_DATA_RECEIVED:			 
		      report = *p_evt->data_received.data;
			    on_hid_rep_char_write(report, p_evt->data_received.len); 
		      break;
		 
		 case M_COMS_BLE_EVT_BONDED:
			    NRF_LOG_INFO("Bonded");
			    //is_bonded = true;
		 
		 
		      //wright : fix for not to infect GPIO output
					//bsp_board_led_on(BSP_LED_INDICATE_USER_LED2);		
		 
		      break;
		 
		 default:
		 break;
		 
	 }	 
}   


static void m_coms_gzll_evt_handler(void * p_event_data, uint16_t event_size)
{
	  gzll_event_t * p_evt = (gzll_event_t *) p_event_data;
	
	
	  switch (*p_evt)
    {
        case gzll_event_search_for_host:
	           NRF_LOG_INFO("Search for Host.");
//             bsp_board_led_invert(BSP_LED_INDICATE_USER_LED3); 
				     app_timer_start(m_app_gzll_search_timer_id, APP_GZLL_SEARCH_INTERVAL, NULL);
             break;				
						  
			  case gzll_event_sysaddr_exchanged:
					   NRF_LOG_INFO("Paired with Host");
//             bsp_board_led_on(BSP_LED_INDICATE_USER_LED3);
				     break;
				
				case gzll_event_hostid_exchanged:
					   NRF_LOG_INFO("Bonded with Host");
			       //is_bonded = true;
//		         bsp_board_led_on(BSP_LED_INDICATE_USER_LED4);		
				     break;
				
				case gzll_event_tx_failed:
//					    NRF_LOG_INFO("GZLL transmit failed !!");
//				      bsp_board_led_off(BSP_LED_INDICATE_USER_LED3);	
//				      bsp_board_led_off(BSP_LED_INDICATE_USER_LED4);	
				     break;
				
				default:
					   break;
				
		}		
}	

/**@brief Function for initializing 
 */
static void modules_init(void)
{		
   //buffer_init();
	 sensor_simulator_init();
   power_management_init();

	 
	if(m_protocol_mode == M_COMS_BLE_MODE_PAIR_1 || m_protocol_mode == M_COMS_BLE_MODE_PAIR_2)
	{	
     m_coms_ble_init(m_coms_ble_evt_handler);
  }
  else
	{	
	  clock_start();
	  m_coms_gzll_init(m_coms_gzll_evt_handler);
		
	}	

}	


static void modules_enable(bool erase_bonds)
{

  if(m_protocol_mode == M_COMS_BLE_MODE_PAIR_1 || m_protocol_mode == M_COMS_BLE_MODE_PAIR_2)
	{	
	
		m_coms_ble_enable(erase_bonds);
		 NRF_LOG_INFO("BLE mode start.");
	}	
	else
	{				
	   m_coms_gzll_enable(erase_bonds);
		 m_coms_gzll_search_for_host();
     NRF_LOG_INFO("GZLL mode start.");		
	}	
		
}

static void protocol_det_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	uint8_t level = nrf_gpio_pin_read(PROTOCOL_DETECT_PIN);
	uint8_t is_softdevice_enabled;
	
  if (pin == PROTOCOL_DETECT_PIN)
	{
	
    NRF_LOG_INFO("Reset!!");
	
    nrf_delay_ms(100);
		
		sd_softdevice_is_enabled(&is_softdevice_enabled);
		
		if (is_softdevice_enabled==1)
		{	
		  sd_nvic_SystemReset();
		}
		else
		{
      NVIC_SystemReset();
    }			

  }		
	
	
}	




/************************************* wright : add keyboard function **************************************/


/**@brief Handler function for keyboard module events
 */
//wright : for mode selection

static uint8_t KEY_CODE_GARZLL_MODE = 0xAA;
static uint8_t KEY_CODE_BLE_MODE_PAIR_1 = 0xAB;
static uint8_t KEY_CODE_BLE_MODE_PAIR_2 = 0xAC;
bool IS_KEY_CODE_MODE_PRESSED = false;

static void mode_change_key_check(m_keyboard_data_t * keyboard_pkt)
{

		//check if keypackage contain change mode key code
		if( keyboard_pkt->keys[0]== KEY_CODE_GARZLL_MODE)
		{
			NRF_LOG_INFO("---PRESS KEY_CODE_GARZLL_MODE !---");
			IS_KEY_CODE_MODE_PRESSED = true;
			current_transmit_mode_data[0] = M_COMS_GZLL_MODE;
		}
			
		if(keyboard_pkt->keys[0] == KEY_CODE_BLE_MODE_PAIR_1)	
		{
			NRF_LOG_INFO("---PRESS KEY_CODE_BLE_MODE_PAIR_1 !---");
			IS_KEY_CODE_MODE_PRESSED = true;
			current_transmit_mode_data[0] = M_COMS_BLE_MODE_PAIR_1;
		}
		if(keyboard_pkt->keys[0] == KEY_CODE_BLE_MODE_PAIR_2)	
		{
			NRF_LOG_INFO("---PRESS KEY_CODE_BLE_MODE_PAIR_2 !---");
			IS_KEY_CODE_MODE_PRESSED = true;
			current_transmit_mode_data[0] = M_COMS_BLE_MODE_PAIR_2;
		}		
		
		//if change key code pressed ; write it to NRF_POWER->GPREGRET 
		if(IS_KEY_CODE_MODE_PRESSED)
		{
			m_keyboard_polling_disable();
			
			change_mode_is_start = true;
			
			NRF_POWER->GPREGRET = current_transmit_mode_data[0];
			
			NRF_LOG_INFO("--- Write current_transmit_mode_data: %d to NRF_POWER->GPREGRET !---",
			current_transmit_mode_data[0]);
		
			//reset after save the mode info
			sd_softdevice_is_enabled(&is_softdevice_enabled);
			
			if (is_softdevice_enabled==1)
			{	
				sd_nvic_SystemReset();
			}
			else
			{
				NVIC_SystemReset();
			}		
			
		}
			
}

//wright 0424: for key swipe problem  
static void gzll_keep_alive_handler()
{
	// Put the previous keyboard packet in buffer.
	//(differ from dt2 :  buffer_keys(&s_gzll_keepalive_keyboard_pkt);  )

		keys_send_fix(s_gzll_keepalive_keyboard_pkt.num_keys,
									s_gzll_keepalive_keyboard_pkt.keys,
									s_gzll_keepalive_keyboard_pkt.modifier_keys);	
}


static void m_keyboard_handler(void * p_event_data, uint16_t event_size)
{
    uint32_t            err_code;
    m_keyboard_data_t * keyboard_pkt;

    ASSERT(event_size == sizeof(m_keyboard_data_t));
    
    keyboard_pkt = (m_keyboard_data_t *) p_event_data;
	
		NRF_LOG_INFO("---Enter m_keyboard_handler!---");

	
		if (keyboard_pkt->pairing_button)
    {
			//do nothing
		}
		else
		{
			//wright : change mode
				if(!change_mode_is_start)
				{
					mode_change_key_check(keyboard_pkt);
				}
				
				keys_send_fix(keyboard_pkt->num_keys,keyboard_pkt->keys,keyboard_pkt->modifier_keys);
				
				//wright 0424: for key swipe problem  
				if(current_transmit_mode_data[0] == M_COMS_GZLL_MODE)
				{
					memcpy(&s_gzll_keepalive_keyboard_pkt, keyboard_pkt, sizeof(m_keyboard_data_t));
					if (m_keyboard_packet_is_empty(keyboard_pkt))
					{
							app_timer_stop(s_gzll_keep_alive_id);
					}
					else
					{
							app_timer_start(s_gzll_keep_alive_id, APP_TIMER_TICKS(500),0);
					}
				}
		}

    m_pwr_mgmt_feed();
}





