wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
void keyboard_module_enable(void)
{
    uint32_t err_code;

	
    err_code = m_keyboard_init(keyboard_format_usbhid, m_keyboard_handler);    
    APP_ERROR_CHECK(err_code); 
    m_keyboard_matrix_enable();
	
	return;


}


/************************************* wright : add keyboard function end**************************************/








//wright : get current mode (ble/gazll) for power manager module
bool get_current_mode()
{
    return m_protocol_mode;
}







/********************************* wright : FDS part ******************************/



static void fds_evt_handler(fds_evt_t const * p_evt)
{
    switch (p_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_INIT Success:");
                m_fds_initialized = true;
            }
            break;

        case FDS_EVT_WRITE:
        {
            if (p_evt->result == FDS_SUCCESS)
            {		
								NRF_LOG_INFO("FDS_EVT_WRITE Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->write.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->write.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->write.record_key);
								fds_busy_flag = false;
            }
        } break;

        case FDS_EVT_DEL_RECORD:
        {
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_DEL_RECORD Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
								fds_busy_flag = false;
            }
        } break;
				
				case FDS_EVT_UPDATE:
				{
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_UPDATE Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
								fds_busy_flag = false;
								//wright: 0418
								NRF_LOG_INFO("====Read file data after \"FDS_EVT_UPDATE Success:\"====");
								//mode_record_read();
            }
        } break;

        default:
            break;
    }
}



static ret_code_t mode_record_delete(void)
{
		fds_busy_flag = true;
    fds_find_token_t tok   = {0};
    fds_record_desc_t desc = {0};
		ret_code_t rc = REC_DEFAULT_VALUE;

    if (fds_record_find(LAST_TRANSMIT_MODE_FILE_ID, LAST_TRANSMIT_MODE_RECORD_KEY, &desc, &tok) == FDS_SUCCESS)
    {
        rc = fds_record_delete(&desc);
        if (rc != FDS_SUCCESS)
        {
						NRF_LOG_INFO("error: fds_record_delete %x",rc);

            return rc;
        }

//        NRF_LOG_INFO("SUCCESS: fds_record_delete -- fid = %X,  rk= %X ",
//				LAST_TRANSMIT_MODE_FILE_ID,
//				LAST_TRANSMIT_MODE_RECORD_KEY);
    }
    else
    {
        NRF_LOG_INFO("record not found!\r\n");
				rc = DELETE_RECORD_NOT_FOUND;
				fds_busy_flag = false;
    }
		
		return rc;
}

static ret_code_t mode_record_write(uint32_t mode_value)
{
		fds_busy_flag = true;
    fds_record_t const rec =
    {
        .file_id           = LAST_TRANSMIT_MODE_FILE_ID,
        .key               = LAST_TRANSMIT_MODE_RECORD_KEY,
        .data.p_data       = &mode_value,
        .data.length_words = 1
    };


    ret_code_t rc = fds_record_write(NULL, &rec);
    if (rc != FDS_SUCCESS)
    {
			NRF_LOG_INFO("fds_record_write failed... error code %d",rc);
    }
		return rc;
}

static ret_code_t mode_record_update(uint32_t mode_value)
{
		//record find
		fds_record_desc_t desc = {0};
		fds_find_token_t  tok  = {0};
		ret_code_t rc;
		fds_flash_record_t frec = {0};
			
		rc=fds_record_find(LAST_TRANSMIT_MODE_FILE_ID,LAST_TRANSMIT_MODE_RECORD_KEY,&desc,&tok);
	
		if (rc != FDS_SUCCESS)
    {
			NRF_LOG_INFO("fds_record_find failed... error code %d",rc);
			return rc;
    }
		
		
		//record update
		fds_busy_flag = true;
    fds_record_t const rec =
    {
        .file_id           = LAST_TRANSMIT_MODE_FILE_ID,
        .key               = LAST_TRANSMIT_MODE_RECORD_KEY,
        .data.p_data       = &mode_value,
        .data.length_words = 1//(2 + 3) / sizeof(uint32_t)
    };
		
		
		NRF_LOG_INFO("==== mode data before update ==== : %d",mode_value);
	
		rc = fds_record_update(&desc, &rec);
		
    if (rc != FDS_SUCCESS)
    {
			NRF_LOG_INFO("fds_record_update failed... error code %d",rc);
			return rc;
    }
		
		
		return rc;
}




static ret_code_t mode_record_read(void)
{

    fds_record_desc_t desc = {0};
    fds_find_token_t  tok  = {0};
		ret_code_t rc;
		fds_flash_record_t frec = {0};
		//uint32_t data_read[1] ={0};
			
		rc=fds_record_find(LAST_TRANSMIT_MODE_FILE_ID,LAST_TRANSMIT_MODE_RECORD_KEY,&desc,&tok);
		

		
		if (rc == FDS_SUCCESS)
		{
				rc = fds_record_open(&desc, &frec);
				if(rc == FDS_SUCCESS)
				{
					current_transmit_mode_data[0] = *(uint32_t *)frec.p_data; 
					NRF_LOG_INFO("Hex dump the contents of p_data\n");
					NRF_LOG_HEXDUMP_INFO(frec.p_data, 4);
					NRF_LOG_INFO("current_transmit_mode_data = %x",current_transmit_mode_data[0]);
					rc = fds_record_close(&desc);			
				}
				else
				{
					NRF_LOG_INFO("open failed!");
				}
			
		}
		//wright : if file not find, create one (Default mode).
		else if (rc == FDS_ERR_NOT_FOUND)
		{
			NRF_LOG_INFO("record not found! , write Default mode into flash...");
			mode_record_write(M_COMS_GZLL_MODE);
		}

		
		return rc;
}


/**@brief   Wait for fds to initialize. */
static void wait_for_fds_ready(void)
{
    while (!m_fds_initialized)
    {
        idle_state_handle();
    }
}





//wright: mode selection 
static uint32_t mode_selection()
{
		uint32_t mode_result = 0;
		ret_code_t ret;

		NRF_LOG_INFO("--- record read ---");
		//read last transmitted mode from gpregret register
		mode_result = NRF_POWER->GPREGRET;
	
		switch(mode_result)
		{
			case 0:
				NRF_LOG_INFO("--- Default Mode : Gazll ---");
				m_protocol_mode= M_COMS_GZLL_MODE;
				break;
			case 1:
				NRF_LOG_INFO("--- BLE Mode : Pairing Device 1 ---");
				m_protocol_mode= M_COMS_BLE_MODE_PAIR_1;
				break;
			case 2:
				NRF_LOG_INFO("--- BLE Mode : Pairing Device 2 ---");
				m_protocol_mode= M_COMS_BLE_MODE_PAIR_2;
				break;
			default :
				NRF_LOG_INFO("--- Default Mode : Gazll ---");
				break;		
		}
		
		return mode_result;
}
/********************************* wright : FDS part end ******************************/







/**@brief Function for application main entry.
 */
int main(void)
{
	//wright : 0422 keep bonding information 
    bool erase_bonds = false;  //bool erase_bonds;  

    // Initialize.
    log_init();

		//wright : Mode selection
		mode_selection();

    timers_init();	

    scheduler_init();
		
    modules_init();

    NRF_LOG_INFO("Dual mode keyboard example started.");

    modules_enable(erase_bonds);

    application_timers_start();
		
		

    //wright : enable keyboard module.
    keyboard_module_enable();

   

    // Enter main loop.
    for (;;)
    {
    idle_state_handle();
    }
}



















